#pragma once
#include <SFML/Graphics.hpp>
#include <iostream>
#include <string>
//const int HEIGHT_MAP = 25;
//const int WIDTH_MAP = 115;
//SETLEVEL
class Level {
	int levelCoin;
	int hight, width;
	string LevelSecond[115] = {
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"0                                                                                                                0",
	"0                                                                                                                0",
	"0             c c c c c c c c c c                                                                                0",
	"0            0000000000000000000000                                                                              0",
	"0                                  000                                                                           0",
	"0                                     00                                                                         0",
	"0                                     000000    c  c  c                                                          0",
	"0                                     000000000000000000000000       c                                           0",
	"0                                                               0000000000        c                              0",
	"0                                                                        0000   000000                   c       0",
	"0                                                                                         c  c     0000000       0",
	"0                                                                                       00000000                 0",
	"0                                                                     c  c        00000                          0",
	"0                                                                   00000000000000                               0",
	"0                                                     c    0000000                                               0",
	"0                                                   0000                                                         0",
	"0                 ccc             0000    0000000000                                                             0",
	"0              00000000                                                                                          0",
	"0                       000000000                                    c c                                         0",
	"0                                0                 c c c           00000000                                      0",
	"0                                            0000000000000000                                                    0",
	"0000000       c c c                    00000000                                                                  0",
	"0000000000000000000000              00000000        c c c     c      c      c c c             c c c              0",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	};
	string LevelFirst[115] = {
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"0                                                                                                                0",
	"0                                                                                                                0",
	"0                                                                                                                0",
	"0                                                                                                                0",
	"0                                                                                                                0",
	"0000000                                00000000                                                                  0",
	"0000000000000000000000              00000000        c         c      c      c c c             c c c c            0",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	};
public:
	string *levelMap;
	Level(int playerLevel){
			  switch (playerLevel) {
			  case 1:  hight = 12;
				  width = 115;
				  levelMap = LevelFirst;
				  levelCoin = 5;
				  break;
			 case 2: 
				 hight = 28;
				 width = 115;
				 levelMap = LevelSecond;
				 levelCoin = 10; 
				 break;
		
			 default: cout << "Error level loading";
			 }
	}
	//string* GetMap() {
	//	return Map;
	//}
	int GetHight() {
		return hight;
	}
	int GetWidth() {
		return width;
	}
	int GetCoin() {
		return levelCoin;
	}
};
//
//string TileMap[HEIGHT_MAP] = {
//	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
//	"0                                                                                                                0",
//	"0                                                                                                                0",
//	"0             c c c c c c c c c c                                                                                0",
//	"0            0000000000000000000000                                                                              0",
//	"0                                  000                                                                           0",
//	"0                                     00                                                                         0",
//	"0                                     000000    c    c  c                                                        0",
//	"0                                     000000000000000000000000       c                                           0",
//	"0                                                               0000000000        c                              0",
//	"0                                                                        0000   000000                           0",
//	"0                                                                                         c c c    0000000       0",
//	"0                                                                                       00000000                 0",
//	"0                                                                     c c c       00000                          0",
//	"0                                                                   00000000000000                               0",
//	"0                                                     c    0000000                                               0",
//	"0                                                   0000                                                         0",
//	"0                           ccc                                                                                  0",
//	"0                        00000000       c    000000                                                              0",
//	"0                                    000000                           c c                                        0",
//	"0                                                  c c c           00000000                                      0",
//	"0               c c c                        0000000000000000                                                    0",
//	"000000000000000000000                  00000000                                                                  0",
//	"0         000000000000              00000000        c c c      c     c      c c c             c c c              0",
//	"000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
//};

//void randomMapGenerate() {//рандомно расставляем камни
//
//
//	int randomElementX = 0;//случайный элемент по горизонтали
//	int randomElementY = 0;//случ эл-т по вертикали
//	srand(time(0));//рандом	
////	int countStone = 1;//количество камней 1
//
//	while (countStone > 0) {
//		randomElementX = 1 + rand() % (WIDTH_MAP - 1);//рандомное по иксу от 1 до ширина карты-1, чтобы не получать числа бордюра карты
//		randomElementY = 1 + rand() % (HEIGHT_MAP - 1);//по игреку так же
//		if (TileMap[randomElementY][randomElementX] == ' ') {//если встретили символ пробел, 
//			TileMap[randomElementY][randomElementX] = 's'; //то ставим туда камень.
//			std::cout << "coordinate of Stone X:" << randomElementX << "\n" << "coordinate of Stone Y:" << randomElementY << "\n\n";
//			countStone--;//создали камень=>счетчик камней будет "текущий минус 1"
//		}
//	}
//}